yanjainxiong/HDMCU_ZLG/HC32L136_SDK/4.集成开发环境支持包/HC32L136_IDE_Rev1.0.0/IAR_IDE/config/debugger/HDSC/HC32L136K8TA.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="UART0">
            <name>UART1</name>
            <description>desc UART</description>
            <baseAddress>0x40000100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>VC</name>
            <description>desc VC</description>
            <baseAddress>0x40002400</baseAddress>
            <alternatePeripheral>ADC</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x28</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x20</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>desc DIV</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIV_EN</name>
                            <description>desc DIV_EN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REF2P5_SEL</name>
                            <description>desc REF2P5_SEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC0_BIAS_SEL</name>
                            <description>desc VC0_BIAS_SEL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC0_HYS_SEL</name>
                            <description>desc VC0_HYS_SEL</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC1_BIAS_SEL</name>
                            <description>desc VC1_BIAS_SEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC1_HYS_SEL</name>
                            <description>desc VC1_HYS_SEL</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VC0_CR</name>
                    <description>desc VC0_CR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFF</resetMask>
                    <fields>
                        <field>
                            <name>P_SEL</name>
                            <description>desc P_SEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>N_SEL</name>
                            <description>desc N_SEL</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLTEN</name>
                            <description>desc FLTEN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEBOUNCE_TIME</name>
                            <description>desc DEBOUNCE_TIME</description>
                            <msb>11</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FALLING</name>
                            <description>desc FALLING</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RISING</name>
                            <description>desc RISING</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEVEL</name>
                            <description>desc LEVEL</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VC1_CR</name>
                    <description>desc VC1_CR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFF</resetMask>
                    <fields>
                        <field>
                            <name>P_SEL</name>
                            <description>desc P_SEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>N_SEL</name>
                            <description>desc N_SEL</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLTEN</name>
                            <description>desc FLTEN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEBOUNCE_TIME</name>
                            <description>desc DEBOUNCE_TIME</description>
                            <msb>11</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FALLING</name>
                            <description>desc FALLING</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RISING</name>
                            <description>desc RISING</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LEVEL</name>
                            <description>desc LEVEL</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>desc IE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VC0_OUT_CFG</name>
                    <description>desc VC0_OUT_CFG</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFE3F</resetMask>
                    <fields>
                        <field>
                            <name>INV_TIMER</name>
                            <description>desc INV_TIMER</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM0RCLR</name>
                            <description>desc TIM0RCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM1RCLR</name>
                            <description>desc TIM1RCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM2RCLR</name>
                            <description>desc TIM2RCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM3RCLR</name>
                            <description>desc TIM3RCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMBK</name>
                            <description>desc TIMBK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV_TIM4</name>
                            <description>desc INV_TIM4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM4</name>
                            <description>desc TIM4</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV_TIM5</name>
                            <description>desc INV_TIM5</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM5</name>
                            <description>desc TIM5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV_TIM6</name>
                            <description>desc INV_TIM6</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM6</name>
                            <description>desc TIM6</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRAKE</name>
                            <description>desc BRAKE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VC1_OUT_CFG</name>
                    <description>desc VC1_OUT_CFG</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFEFF</resetMask>
                    <fields>
                        <field>
                            <name>INV_TIMER</name>
                            <description>desc INV_TIMER</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM0RCLR</name>
                            <description>desc TIM0RCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM1RCLR</name>
                            <description>desc TIM1RCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM2RCLR</name>
                            <description>desc TIM2RCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM3RCLR</name>
                            <description>desc TIM3RCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMBK</name>
                            <description>desc TIMBK</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV_TIM4</name>
                            <description>desc INV_TIM4</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM4</name>
                            <description>desc TIM4</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV_TIM5</name>
                            <description>desc INV_TIM5</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM5</name>
                            <description>desc TIM5</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INV_TIM6</name>
                            <description>desc INV_TIM6</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM6</name>
                            <description>desc TIM6</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRAKE</name>
                            <description>desc BRAKE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFR</name>
                    <description>desc IFR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>VC0_INTF</name>
                            <description>desc VC0_INTF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC1_INTF</name>
                            <description>desc VC1_INTF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC0_FILTER</name>
                            <description>desc VC0_FILTER</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>VC1_FILTER</name>
                            <description>desc VC1_FILTER</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
